p4/apiUrbanest_api/app/controllers/casas_controller.rb

SELECT "casas".* FROM "casas"
---
    def index
        #@casas = Casa.where(propietario:params[:propietario])
        @casas = Casa.all