p4/apiUrbanest_api/app/controllers/casas_controller.rb

    def index
        @casas = Casa.where(propietario:params[:propietario])
---
SELECT "casas".* FROM "casas" WHERE "casas"."propietario" = ?  [["propietario", "Victor"]]

    def show
        @casa = Casa.find(params[:id])
---
SELECT "casas".* FROM "casas" WHERE "casas"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

    def create
        @casa = Casa.create(casa_params)
---
INSERT INTO "casas" ("tipo_casa", "cocina", "banio", "sala_estar", "propietario", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"

    def update
        @casa = Casa.find(params[:id])
        if @casa.update(casa_params)
---
SELECT "casas".* FROM "casas" WHERE "casas"."id" = ? LIMIT ?  [["id", 39], ["LIMIT", 1]]
UPDATE "casas" SET "cocina" = ?, "banio" = ?, "updated_at" = ? WHERE "casas"."id" = ?  [["cocina", "Cocina"], ["banio", "Baño Con jacuzzi"], ["updated_at", "2024-05-18 15:26:32.488601"], ["id", 39]]

    def destroy
        @casa = Casa.find(params[:id])
        if @casa.destroy
---
SELECT "casas".* FROM "casas" WHERE "casas"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "casas" WHERE "casas"."id" = ?  [["id", 2]]

    def deleteAll
        Dormitorio.delete_all
---
DELETE FROM "dormitorios"